Repository: small-tech/comet
Catalog: po/*.po
Languages: nl, tr

source: Made with ♥ by Small Technology Foundation, a tiny, independent not-for-profit
nl: Gemaakt met ♥ door Small Technology Foundation, een kleine, onafhankelijke non-profitorganisatie
tr: ♥ Minicik, bağımsız ve kar amacı gütmeyen Small Technology Foundation (Küçük Teknoloji Kurumu) tarafından sevgiyle yapılmıştır

source: Small Technology are everyday tools for everyday people designed to increase human welfare, not corporate profits.
nl: Small Technology zijn dagelijkse gereedschappen voor gewone mensen die zijn ontworpen om het menselijk welzijn te vergroten, niet de bedrijfswinsten.
tr: Küçük Teknoloji kurumsal karları değil, insan refahını artırmak için yaratılan, günlük insanlar için günlük aletlerdir.

source: Like this? Fund us!
nl: Vind je dit leuk? Financier ons!
tr: Bunu beğendiniz mi? Bizi destekleyin!

source: Copyright
tr: Telif Hakkı

source: License GPLv3+: GNU GPL version 3
nl: Licentie GPLv3+: GNU GPL versie 3
tr: Lisansı GPLv3: GNU GPL sürüm 3

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
nl: Dit is vrije software: je bent vrij om het te veranderen en te herdistribueren. Er is GEEN GARANTIE, voor zover toegestaan door de wet.
tr: Bu özgür yazılımdır: değiştirebilirsiniz ve dağıtabilirsiniz. Yasaların izin verdiği kapsamda hiçbir garanti içermez.

source: Write better Git commit messages.
nl: Schrijf betere Git commit berichten.
tr: Daha iyi Git işleme mesajları yaz.

source: <path-to-git-commit-message-file>
tr: <git-işleme-mesaj-dosyasının-yolu>

source: Show version number and exit
nl: Versienummer weergeven en afsluiten
tr: Sürüm numarasını göster ve çik

source: Error: Too many files (%d).
nl: Fout: Te veel bestanden (%d).
tr: Hata: Çok fazla dosya (%d).

source: Comet can’t read the Git commit message.
nl: Comet kan het Git commit bericht niet lezen.
tr: Comet Git işlem mesajını okuyamıyor.

source: The Report Error button will take you to a pre-filled issue on GitHub that you can submit to help improve Comet.
nl: Met de knop Fout Melden gaat u naar een vooraf ingevuld issue op GitHub dat u kunt indienen om Comet te helpen verbeteren.
tr: Hata Raporu Aç düğmesi sizi GitHub¯sitesinde gönderilmeye hazır birhata raporuna götürür.

source: Report Error
nl: Fout Melden
tr: Hata Raporu Aç

source: Hide tip
nl: Tip verbergen
tr: İpucuyu sakla

source: Commit
tr: İşle

source: Cancel
nl: Annuleren
tr: İptal et

source: Use keyboard shortcuts to improve your workflow.
nl: Gebruik sneltoetsen om uw workflow te verbeteren.
tr: Daha hızlı çalışmak için klavye kısayollarını kullan.

source: Could not save commit message.
nl: Kan commit-bericht niet opslaan.
tr: İşleme mesajını kaydedemedik.

source: No characters left on first line.
nl: Geen tekens meer op de eerste regel.
tr: İşleme mesajını kaydedemedik.

source: %d character left on first line.
nl: %d teken over op de eerste regel.
tr: İlk satır limitine %d harf kaldı.

source: Comet: Sorry, this does not look like a valid Git commit message (it’s missing a comment section): %s
nl: Comet: Sorry, dit ziet er niet uit als een geldig Git commit bericht (het mist een commentaar sectie): %s
tr: Comet: Ne yazık ki bu geçerli bir Git işleme mesajına benzemiyor (yorum bölümü eksik): %s

source: branch %s
tr: dal %s

source: manual hunk edit mode
nl: handmatige hunk-bewerkingsmodus
tr: el ile parça düzenleme kipi

source: Warning: unknown Git commit type encountered in %s
nl: Waarschuwing: onbekend Git commit type aangetroffen in %s
tr: Uyarı: bilinmeyen Git işlem türü ile karşılaşıldi: %s

source: Disable Comet
nl: Comet uitschakelen
tr: Comet’i Devre Dışı Bırak

source: Revert to using your previous editor for Git commit messages.
nl: Ga terug naar het gebruik van je vorige editor voor Git commit-berichten.
tr: Bir önceki Git işlem düzenleyicini kullanmaya geri dön.

source: Enable Comet
nl: Comet inschakelen
tr: Comet’i Etkinleştir

source: Use Comet as the default editor for Git commit messages.
nl: Gebruik Comet als de standaardeditor voor Git commit-berichten.
tr: Comet’i öntanımlı Git işlem mesajı düzenleyicin olarak kullan.

source: Help
tr: Yardım

source: Having trouble? Get help and report issues.
nl: Problemen? Verkrijg hulp en meld problemen.
tr: Sorun mu yaşıyorsun? Bilgi al ve sorun raporu aç.

source: Comet is enabled as your editor for Git commit messages.
nl: Comet is ingeschakeld als je editor voor Git commit berichten.
tr: Comet öntanımlı Git işlem düzenleyiciniz olarak etkinleştirildi.

source: Comet is disabled.
nl: Comet is uitgeschakeld.
tr: Comet devre dışı bırakıldı.

source: First line character limit
nl: Tekenlimiet eerste regel
tr: İlk satır karakter sınırı

source: Dogmatic (50)
nl: Dogmatisch (50)
tr: Dogmatik (50)

source: GitHub truncation (72)
nl: GitHub-afkapping (72)
tr: GitHub kesme noktası (72)

source: GitLab truncation (100)
nl: GitLab afkapping (100)
tr: GitLab kesme noktası (100)

source: Settings
nl: Instellingen
tr: Ayarlar

source: This is the summary line of your Git commit message; make sure it isn’t too long You can change the suggested length in the Settings Menu.
nl: Dit is de samenvattende regel van je Git commit-bericht; zorg ervoor dat het niet te lang is U kunt de voorgestelde lengte wijzigen in het menu Instellingen.
tr: Bu Git işlem mesajınızın özet satırı olduğu için kısa tutulur; yani çok fazla uzatılmaz Tavsiye edilen satır uzunluğunu Ayarlar Menüsünden değiştirebilirsiniz.

source: Dogma (n): a settled opinion, belief, or principle
nl: Dogma (n): een vaste mening, overtuiging of principe
tr: Dogma (i): Doğruluğu sınanmadan benimsenen bir öğreti

source: Press Control + . (period) to insert emoji
nl: Druk op Control + . (punt) om emoji in te voegen
tr: Emoji eklemek için Ctrl + . (nokta) tuşlarını kullanın

source: Highlights splling mstakes
nl: Markeert splfouten
tr: Yazm htalarını vurgular

source: Git Commit Message Editor
nl: Git Commit Bericht Editor
tr: Git İşlem Mesajı Düzenleyicisi

source: Write better Git commit messages
nl: Schrijf betere Git commit berichten
tr: Daha iyi Git işleme mesajları yaz.

source: git;commit;message;editor
tr: git;işlem;mesaj;düzenleyici

source: A distraction-free Git commit message editor with spell-check, first line character limit warnings, and emoji support.
nl: Een afleidingsvrije Git commit-berichteditor met spellingcontrole, waarschuwingen voor tekenlimieten in de eerste regel en emoji-ondersteuning.
tr: Yazım denetimi, ilk satır karakter sınırı uyarısı, ve emoji desteği olan ve dikkat dağıtmayan bir Git işleme mesajı düzenleyicisi.

source: Small Technology Foundation
tr: Küçüĸ Teknoloji Vakfı
